<template>
  <div >
    <el-container>
      <el-main class="flex">
        <div id="mainText">Hi，我是陳緯寧，來自台北市，就讀德明財經科技大學資訊管理系四年級，目前在三商電腦股份有限公司擔任實習工程師一職。<br/>
  高中時期就讀資料處理科，就對自己編寫程式碼很有興趣，在高中時擔任專題組長，帶領小組奪取第三名，透過專題增進自己的HTML、CSS能力，更重要的是如何規劃合適的 進度與團隊進行協作，及發揮領導者的效能以維持團隊凝聚力，我不僅培養了更加敏銳的觀察力，也具備了團隊領導、溝通及分配資源的能力。在大學階段我於入學第一年即開始積極 地探索自己未來職涯的各種可能，透過學校的程式設計課程，跟著老師學習C#後，發現完成一組程式超有成就感，讓我對程式設計更想鑽研，因此也參加ASP.NET MVC與Python的研習並且考取Python證照，未來也想更專精於這方面，有計劃繼續研修碩士。我還喜歡攝影及動畫，透過影像處理實務課程精進自己的修圖能力及繪圖技術。<br/>
  時間有限的情況下，時間管理的能力十分重要，如何有效率的完成每一件事是我對自 己的要求也是工作中得到的寶貴經驗。每天我都會整理當天的待辦事項，並依重要度與急迫 性排序，晚上也會整理隔天的待辦事項，除了降低遺漏的機率，也能清楚明白工作及學業進度，並井然有序完成任務。順遂的學習過程、擁有漂亮的學歷與經歷，其實是透過一連串嘗試、跌倒、學習、成長再嘗試、跌倒、學習、成長不斷循環的歷程所堆砌而成，也因此我一直相信唯有不害怕跌倒、透過不間斷的學習過程，才能讓自己不斷成長。<br/>
  大學時代便確信自己想往資訊領域發展，除了在校學習理論，閒暇時間也不斷進修相 關課程及加強AI、PS的能力，同時也積極參與研習及競賽累積實務經驗。我深信現代的工 作不能墨守成規，應保持積極進取的企圖心，持續吸取新的知識與技能。我一直充滿活力蓄 勢待發，迫不及待面對新的挑戰及學習新事物。過去的競賽經驗，相信都能成為我未來職涯 的要件，貴公司在科技業力求突破與創新，同時鼓勵員工不斷進修，培訓計畫也非常完善，理念與我十分相似，期盼能進入貴公司發揮所學，並持續成長，創造價值。 感謝您百忙之中看我的履歷，希望有機會可以加入貴公司的團隊!
          </div>
      </el-main>
      <el-footer>{{ footer }}</el-footer>
      
    </el-container>
    <router-view/>
  </div>
  
</template>

<script>
  import { ref } from 'vue';
  
  export default {
    setup() {
      const footer = ref("Neil Chen");

      return {
        footer
      }
    },
    computed: {
      
    },
    
  }
</script>

<style>


  .el-main{
    height: auto;max-width: auto;justify-content: center;
  }
  #mainText{
    width: 60vw;text-align: center;padding-top: 3%;font-size: larger;line-height:40px;
  }
  @media (min-width: 1400px){

  }
</style>
